--Парметр - название предмета, код ученика
--Результат - все оценки ученика по этому предмету
--Поля: дата получения, время урока, название предмета, ФИО ученика

Drop proc Оценки_ученика
GO

Create proc Оценки_ученика @дисциплина varchar(80), @код_ученика int AS
  Select Оценки.Код, [Код урока], cast(null AS date) Дата , [Код расписания], cast(null AS time) Время 
  , cast(null AS varchar(80)) Дисциплина, [Код ученика], cast(null AS varchar(80)) ФИО, Балл into #res
    From Оценки, Урок, Расписание, Предмет
    Where Предмет.Код = Расписание.[Код предмета] AND Расписание.Код = Урок.[Код расписания] AND Урок.Код = Оценки.[Код урока] 
    AND Дисциплина = @дисциплина AND [Код ученика] = @код_ученика
  Update #res
    Set ФИО = (
      Select ФИО From Ученик
        Where Код = @код_ученика
    )
  Update #res
    Set Дисциплина = @дисциплина
  Update #res
    Set Дата = (
      Select Дата From Урок
        Where Код = [Код урока]
    )
  Update #res
    Set Время = (
      Select Время From Расписание
        Where Код = [Код расписания]
    )
  Select * From #res
GO

Exec Оценки_ученика 'Информатика', 3
GO