-- параметр - класс, дисциплина
-- результат - количество оценок в этом классе по этой дисциплине
--У параметров должны быть значения по умолчанию

Drop proc КолОцен
GO

Create proc КолОцен @класс varchar(40) = '2В', @дисциплина varchar(40) = 'Информатика'
AS
If @класс is not null AND @дисциплина is not null
  Select count(Балл) AS Кол
    From Класс, Ученик, Оценки, Урок, Расписание, Предмет
      Where Класс.Код = Ученик.[Код класса] AND Ученик.Код = Оценки.[Код ученика] AND
      Оценки.[Код урока] = Урок.Код AND Урок.[Код расписания] = Расписание.Код AND Расписание.[Код предмета] = Предмет.Код AND
      Класс = @класс AND Дисциплина = @дисциплина
Else
  If @класс is not null 
    Select count(Балл) AS Кол
      From Класс, Ученик, Оценки
        Where Класс.Код = Ученик.[Код класса] AND Ученик.Код = Оценки.[Код ученика] AND Класс = @класс 
  Else
    If @дисциплина is not null 
      Select count(Балл) AS Кол
        From Оценки, Урок, Расписание, Предмет
          Where Оценки.[Код урока] = Урок.Код AND Урок.[Код расписания] = Расписание.Код AND Расписание.[Код предмета] = Предмет.Код AND Дисциплина = @дисциплина 
    Else
      Select count(Балл) AS Кол
        From Оценки
GO
     
Exec КолОцен '2В', 'Информатика'
Exec КолОцен '2В', Null
Exec КолОцен Null, 'Информатика'
Exec КолОцен Null, Null

Exec КолОцен @класс = '11Б', @дисциплина = 'Информатика'
Exec КолОцен '2В', @дисциплина = 'Русский язык'
Exec КолОцен '2В'